Revit 2027 API
ParameterTypeId.BendingDetailTypeAngularDimensionTypeId Property
 "Angular Dimension Style"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BendingDetailTypeAngularDimensionTypeId { get; }
Public Shared ReadOnly Property BendingDetailTypeAngularDimensionTypeId As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BendingDetailTypeAngularDimensionTypeId {
	ForgeTypeId^ get ();
}
static member BendingDetailTypeAngularDimensionTypeId : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace